RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_hwmgr_impl_part.h
#if defined(COMPONENT_CAT1A)
// 12 dedicated = IMO, EXT, ILO, FLL, LF, Pump, BAK, Timer, AltSysTick, Slow, Fast, Peri
//  7 optional =  ECO, ALTHF, ALTLF, PILO, WCO, MFO, MF
#define CY_CHANNEL_COUNT_CLOCK      (12 + 7 + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_HFROOT + PERI_DIV_NR)
#elif defined(COMPONENT_CAT1B)
// 10 dedicated = IHO, IMO, EXT, ILO, FLL, LF, Pump, BAK, AltSysTick, Peri
//  7 optional =  ECO, ALTHF, ALTLF, PILO, WCO, MFO, MF
#define CY_CHANNEL_COUNT_CLOCK      (10 + 7 + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + PERI_DIV_NR)
// TODO : to be fixed
#elif defined(COMPONENT_CAT1C)
// 15 dedicated = IMO, EXT, ILO, IL01, FLL, LF, Pump, BAK, AltSysTick, Peri, Fast0, Fast1, Slow, Mem, Timer
//  2 optional =  ECO, WCO
#define CY_CHANNEL_COUNT_CLOCK      (15 + 2 + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + PERI_DIV_NR)
// TODO : to be fixed
#elif defined(COMPONENT_CAT1D)
// 10 dedicated = IMO, EXT, ILO, IL01, FLL, LF, Pump, BAK, AltSysTick, Peri
//  2 optional =  ECO, WCO
#define CY_CHANNEL_COUNT_CLOCK      (10 + 2 + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT)
#elif defined(COMPONENT_CAT2)
// 7 dedicated = IMO, EXT, ILO, HF, LF, PUMP, SYSCLK
// 5 optional  = ECO, WCO, PLL, PLLSEL, WDCSEL
#define CY_CHANNEL_COUNT_CLOCK      (7 + 5 + PERI_PCLK_CLOCK_NR)
#endif

#if defined(CY_IP_MXCRYPTO_INSTANCES)
    #define CY_BLOCK_COUNT_CRYPTO   (CY_IP_MXCRYPTO_INSTANCES)
#elif defined(CY_IP_MXCRYPTOCELL_INSTANCES)
    #define CY_BLOCK_COUNT_CRYPTO   (CY_IP_MXCRYPTOCELL_INSTANCES)
#elif defined(CPUSS_CRYPTO_PRESENT)
    #define CY_BLOCK_COUNT_CRYPTO   (CPUSS_CRYPTO_PRESENT)
#elif defined(CY_IP_M0S8CRYPTO_INSTANCES)
    #define CY_BLOCK_COUNT_CRYPTO   (CY_IP_M0S8CRYPTO_INSTANCES)
#elif defined(CY_IP_M0S8CRYPTOLITE_INSTANCES)
    #define CY_BLOCK_COUNT_CRYPTO   (CY_IP_M0S8CRYPTOLITE_INSTANCES)
#else
    #define CY_BLOCK_COUNT_CRYPTO   (0)
#endif

#if defined(CY_IP_MXS40PASS_CTDAC_INSTANCES)
    #define CY_BLOCK_COUNT_DAC      (CY_IP_MXS40PASS_CTDAC_INSTANCES)
#else
    #define CY_BLOCK_COUNT_DAC      (0)
#endif

#if defined(CY_IP_M4CPUSS_DMAC_INSTANCES)
    #define CY_BLOCK_COUNT_DMA      (CY_IP_M4CPUSS_DMAC_INSTANCES)
    #define CY_CHANNEL_COUNT_DMA    (CPUSS_DMAC_CH_NR)
#elif defined(CY_IP_MXAHBDMAC_INSTANCES)
    #define CY_BLOCK_COUNT_DMA      (CY_IP_MXAHBDMAC_INSTANCES)

    #if (CY_IP_MXAHBDMAC_INSTANCES == 0)
        #define CY_CHANNEL_COUNT_DMA (0u)
    #elif (CY_IP_MXAHBDMAC_INSTANCES == 1)
        #define CY_CHANNEL_COUNT_DMA (MXAHBDMAC0_CH_NR)
    #elif (CY_IP_MXAHBDMAC_INSTANCES == 2)
        #define CY_CHANNEL_COUNT_DMA (MXAHBDMAC0_CH_NR + MXAHBDMAC1_CH_NR)
    #elif (CY_IP_MXAHBDMAC_INSTANCES == 3)
        #define CY_CHANNEL_COUNT_DMA (MXAHBDMAC0_CH_NR + MXAHBDMAC1_CH_NR + MXAHBDMAC2_CH_NR)
    #else
        #warning "Unhandled DMA instance count"
    #endif
#elif defined(CPUSS_CPUMEMSS_DMAC_PRESENT)
    #define CY_BLOCK_COUNT_DMA      (CPUSS_CPUMEMSS_DMAC_PRESENT)
    #define CY_CHANNEL_COUNT_DMA    (CPUSS_DMAC_CH_NR)
#elif defined(CPUSS_DMAC_PRESENT)
    #define CY_BLOCK_COUNT_DMA      (CPUSS_DMAC_PRESENT)
    #define CY_CHANNEL_COUNT_DMA    (CPUSS_DMAC_CH_NR)
#else
    #define CY_BLOCK_COUNT_DMA      (0)
    #define CY_CHANNEL_COUNT_DMA    (0)
#endif

#if defined(CY_IP_M4CPUSS_DMA_INSTANCES)
    #define CY_BLOCK_COUNT_DW       (CY_IP_M4CPUSS_DMA_INSTANCES)
    #define CY_CHANNEL_COUNT_DW     (CPUSS_DW0_CH_NR + CPUSS_DW1_CH_NR)
#elif defined(CY_IP_MXDW_INSTANCES) && (CPUSS_DW0_PRESENT == 1)
    #define CY_BLOCK_COUNT_DW       (CY_IP_MXDW_INSTANCES)
    #if(CPUSS_DW1_PRESENT == 1)
        #define CY_CHANNEL_COUNT_DW     (CPUSS_DW0_CH_NR + CPUSS_DW1_CH_NR)
    #else
        #define CY_CHANNEL_COUNT_DW     (CPUSS_DW0_CH_NR)
    #endif
#elif defined(CPUSS_DW_NR)
    #define CY_BLOCK_COUNT_DW       (CPUSS_DW_NR)
    #if (CPUSS_DW_NR == 0)
        #define CY_CHANNEL_COUNT_DW     (0)
    #elif (CPUSS_DW_NR == 1)
        #define CY_CHANNEL_COUNT_DW     (CPUSS_DW0_CH_NR)
    #elif (CPUSS_DW_NR == 2)
        #define CY_CHANNEL_COUNT_DW     (CPUSS_DW0_CH_NR + CPUSS_DW1_CH_NR)
    #else
        #warning "Unhandled number of DataWire controllers."
    #endif /* CPUSS_DW_NR is 0, 1, 2, or other (unhandled) */
#else
    #define CY_BLOCK_COUNT_DW       (0)
    #define CY_CHANNEL_COUNT_DW     (0)
#endif

#ifdef CY_IP_MXETH_INSTANCES
    #define CY_BLOCK_COUNT_ETH      (CY_IP_MXETH_INSTANCES)
#else
    #define CY_BLOCK_COUNT_ETH      (0)
#endif

#if defined(IOSS_GPIO_GPIO_PORT_NR)
    #define CY_BLOCK_COUNT_GPIO     (IOSS_GPIO_GPIO_PORT_NR)
    #define CY_CHANNEL_COUNT_GPIO   (8 * IOSS_GPIO_GPIO_PORT_NR)
#else
    #define CY_BLOCK_COUNT_GPIO     (0)
    #define CY_CHANNEL_COUNT_GPIO   (0)
#endif

#if defined(CY_IP_MXAUDIOSS_INSTANCES)
    #define CY_BLOCK_COUNT_I2S      (CY_IP_MXAUDIOSS_INSTANCES)
#else
    #define CY_BLOCK_COUNT_I2S      (0)
#endif

#ifdef CY_IP_MXI3C_INSTANCES
    #define CY_BLOCK_COUNT_I3C      (CY_IP_MXI3C_INSTANCES)
#else
    #define CY_BLOCK_COUNT_I3C      (0)
#endif

#if defined(CY_IP_MXKEYSCAN_INSTANCES)
    #define CY_BLOCK_COUNT_KEYSCAN   (CY_IP_MXKEYSCAN_INSTANCES)
#else
    #define CY_BLOCK_COUNT_KEYSCAN   (0)
#endif

#if defined(CY_IP_MXLCD_INSTANCES)
    #define CY_BLOCK_COUNT_LCD      (CY_IP_MXLCD_INSTANCES)
#elif defined(CY_IP_M0S8LCD_INSTANCES)
    #define CY_BLOCK_COUNT_LCD      (CY_IP_M0S8LCD_INSTANCES)
#else
    #define CY_BLOCK_COUNT_LCD      (0)
#endif

#if defined(CY_IP_MXLIN_INSTANCES)
    #define CY_BLOCK_COUNT_LIN      (CY_IP_MXLIN_INSTANCES)
#else
    #define CY_BLOCK_COUNT_LIN      (0)
#endif

#if defined(CY_IP_MXLPCOMP_INSTANCES)
    #define CY_BLOCK_COUNT_LPCOMP   (CY_IP_MXLPCOMP_INSTANCES)
#elif defined(CY_IP_M0S8LPCOMP_INSTANCES)
    #define CY_BLOCK_COUNT_LPCOMP   (CY_IP_M0S8LPCOMP_INSTANCES)
#else
    #define CY_BLOCK_COUNT_LPCOMP   (0)
#endif
#define CY_CHANNEL_COUNT_LPCOMP     (2 * CY_BLOCK_COUNT_LPCOMP)

#if defined(PASS_NR_CTBS)
    #define CY_BLOCK_COUNT_OPAMP    (PASS_NR_CTBS)
#elif defined(PASS0_NR_CTBS)
    #if defined(PASS1_NR_CTBS)
        #define CY_BLOCK_COUNT_OPAMP    ((PASS0_NR_CTBS + PASS1_NR_CTBS))
    #else
        #define CY_BLOCK_COUNT_OPAMP    (PASS0_NR_CTBS)
    #endif
#else
    #define CY_BLOCK_COUNT_OPAMP    (0)
#endif
#define CY_CHANNEL_COUNT_OPAMP      (2 * CY_BLOCK_COUNT_OPAMP)

#if defined(CY_IP_MXAUDIOSS_INSTANCES)
    #define CY_BLOCK_COUNT_PDMPCM   (CY_IP_MXAUDIOSS_INSTANCES)
#elif defined(CY_IP_MXPDM_INSTANCES)
    #define CY_BLOCK_COUNT_PDMPCM   (CY_IP_MXPDM_INSTANCES)
#else
    #define CY_BLOCK_COUNT_PDMPCM   (0)
#endif

#if defined(CY_IP_MXSMIF_INSTANCES)
    #define CY_BLOCK_COUNT_QSPI     (CY_IP_MXSMIF_INSTANCES)
#else
    #define CY_BLOCK_COUNT_QSPI     (0)
#endif

