RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_hwmgr_impl_part.h
#if (defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS40SRSS)) && SRSS_BACKUP_PRESENT
    #define CY_BLOCK_COUNT_RTC      (1)
#else
    #define CY_BLOCK_COUNT_RTC      (0)
#endif

#if defined(CY_IP_MXSCB_INSTANCES) || defined(CY_IP_M0S8SCB_INSTANCES)
    #define CY_BLOCK_COUNT_SCB      (_SCB_ARRAY_SIZE)
#else
    #define CY_BLOCK_COUNT_SCB      (0)
#endif

#if defined(CY_IP_MXSDHC_INSTANCES)
    #define CY_BLOCK_COUNT_SDHC     (CY_IP_MXSDHC_INSTANCES)
#else
    #define CY_BLOCK_COUNT_SDHC     (0)
#endif

#ifdef CY_IP_MXSDIODEV_INSTANCES
    #define CY_BLOCK_COUNT_SDIODEV  (CY_IP_MXSDIODEV_INSTANCES)
#else
    #define CY_BLOCK_COUNT_SDIODEV  (0)
#endif

#if defined(CY_IP_MXTCPWM_INSTANCES)
    #define CY_BLOCK_COUNT_TCPWM    CY_IP_MXTCPWM_INSTANCES
    #if (CY_IP_MXTCPWM_VERSION == 1)
        #if (CY_IP_MXTCPWM_INSTANCES == 0)
            #define CY_CHANNEL_COUNT_TCPWM (0u)
        #elif (CY_IP_MXTCPWM_INSTANCES == 1)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 2)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 3)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 4)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 5)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 6)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 7)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 8)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR + TCPWM7_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 9)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR + TCPWM7_CNT_NR + TCPWM8_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES == 10)
            #define CY_CHANNEL_COUNT_TCPWM (TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR + TCPWM7_CNT_NR + TCPWM8_CNT_NR + TCPWM9_CNT_NR)
        #elif (CY_IP_MXTCPWM_INSTANCES > 10)
            #warning "Unhandled TCPWM instance count"
        #endif
    #elif (CY_IP_MXTCPWM_VERSION == 2)
        #if (CY_IP_MXTCPWM_INSTANCES == 1)
            #if (TCPWM_GRP_NR == 0)
                #define CY_CHANNEL_COUNT_TCPWM (0u)
            #elif (TCPWM_GRP_NR == 1)
                #define CY_CHANNEL_COUNT_TCPWM (TCPWM_GRP_NR0_GRP_GRP_CNT_NR)
            #elif (TCPWM_GRP_NR == 2)
                #define CY_CHANNEL_COUNT_TCPWM (TCPWM_GRP_NR0_GRP_GRP_CNT_NR + TCPWM_GRP_NR1_GRP_GRP_CNT_NR)
            #elif (TCPWM_GRP_NR == 3)
                #define CY_CHANNEL_COUNT_TCPWM (TCPWM_GRP_NR0_GRP_GRP_CNT_NR + TCPWM_GRP_NR1_GRP_GRP_CNT_NR + TCPWM_GRP_NR2_GRP_GRP_CNT_NR)
            #elif (TCPWM_GRP_NR == 4)
                #define CY_CHANNEL_COUNT_TCPWM (TCPWM_GRP_NR0_GRP_GRP_CNT_NR + TCPWM_GRP_NR1_GRP_GRP_CNT_NR + TCPWM_GRP_NR2_GRP_GRP_CNT_NR + TCPWM_GRP_NR3_GRP_GRP_CNT_NR)
            #elif (TCPWM_GRP_NR > 4)
                #warning "Unhandled TCPWM instance count"
            #endif
        #elif (CY_IP_MXTCPWM_INSTANCES == 2)
            #if (TCPWM0_GRP_NR == 0)
                #define CY_CHANNEL_COUNT_TCPWM0 (0u)
            #elif (TCPWM0_GRP_NR == 1)
                #define CY_CHANNEL_COUNT_TCPWM0 (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR)
            #elif (TCPWM0_GRP_NR == 2)
                #define CY_CHANNEL_COUNT_TCPWM0 (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR)
            #elif (TCPWM0_GRP_NR == 3)
                #define CY_CHANNEL_COUNT_TCPWM0 (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR + TCPWM0_GRP_NR2_GRP_GRP_CNT_NR)
            #elif (TCPWM0_GRP_NR > 3)
                #warning "Unhandled TCPWM instance count"
            #endif
            #if (TCPWM1_GRP_NR == 0)
                #define CY_CHANNEL_COUNT_TCPWM1 (0u)
            #elif (TCPWM1_GRP_NR == 1)
                #define CY_CHANNEL_COUNT_TCPWM1 (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR)
            #elif (TCPWM1_GRP_NR == 2)
                #define CY_CHANNEL_COUNT_TCPWM1 (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR)
            #elif (TCPWM1_GRP_NR == 3)
                #define CY_CHANNEL_COUNT_TCPWM1 (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR + TCPWM1_GRP_NR2_GRP_GRP_CNT_NR)
            #elif (TCPWM1_GRP_NR > 3)
                #warning "Unhandled TCPWM instance count"
            #endif
            #define CY_CHANNEL_COUNT_TCPWM (CY_CHANNEL_COUNT_TCPWM0 + CY_CHANNEL_COUNT_TCPWM1)
        #elif (CY_IP_MXTCPWM_INSTANCES > 2)
            #warning "Unhandled TCPWM instance count"
        #endif
    #else
        #warning "Unrecognized TCPWM IP version"
    #endif
#elif defined(CY_IP_M0S8TCPWM_INSTANCES)
    #define CY_BLOCK_COUNT_TCPWM        (CY_IP_M0S8TCPWM_INSTANCES)
    #if (CY_IP_M0S8TCPWM_INSTANCES == 0)
        #define CY_CHANNEL_COUNT_TCPWM  (0u)
    #elif (CY_IP_M0S8TCPWM_INSTANCES == 1)
        #define CY_CHANNEL_COUNT_TCPWM  (TCPWM_CNT_NR)
    #else
        #warning "Unhandled TCPWM instance count"
    #endif
#else
    #define CY_BLOCK_COUNT_TCPWM    (0)
    #define CY_CHANNEL_COUNT_TCPWM  (0)
#endif

#ifdef CY_IP_MXTDM_INSTANCES
    #define CY_BLOCK_COUNT_TDM      (CY_IP_MXTDM_INSTANCES)
    #if (CY_IP_MXTDM_INSTANCES == 0)
        #define CY_CHANNEL_COUNT_TDM (0u)
    #elif (CY_IP_MXTDM_INSTANCES == 1)
        #define CY_CHANNEL_COUNT_TDM (TDM_NR)
    #else
        #warning "Unhandled TDM instance count"
    #endif
#else
    #define CY_BLOCK_COUNT_TDM      (0)
    #define CY_CHANNEL_COUNT_TDM    (0u)
#endif

#if defined(CY_IP_MXUDB_INSTANCES)
    #define CY_BLOCK_COUNT_UDB      (CY_IP_MXUDB_INSTANCES)
#else
    #define CY_BLOCK_COUNT_UDB      (0)
#endif

#if defined(CY_IP_MXUSBFS_INSTANCES)
    #define CY_BLOCK_COUNT_USB      (CY_IP_MXUSBFS_INSTANCES)
#else
    #define CY_BLOCK_COUNT_USB      (0)
#endif

#if defined(CY_IP_MXUSBPD_INSTANCES)
    #define CY_BLOCK_COUNT_USBPD    CY_IP_MXUSBPD_INSTANCES
#else
    #define CY_BLOCK_COUNT_USBPD    (0)
#endif

#if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS)
    #define CY_BLOCK_COUNT_MCWDT    (SRSS_NUM_MCWDT)
#elif (defined(CY_IP_S8SRSSLT_INSTANCES) && defined(CY_IP_M0S8WCO))
    #define CY_BLOCK_COUNT_MCWDT    (CY_IP_M0S8WCO_INSTANCES)
#else
    #define CY_BLOCK_COUNT_MCWDT    (0)
#endif

#if (defined(CY_IP_MXTCPWM_INSTANCES) && (CY_IP_MXTCPWM_VERSION >= 2) && (CY_IP_MXTCPWM_INSTANCES == 2))
    #if (TCPWM0_GRP_NR > 3)
        #define _CYHAL_TCPWM0_TOTAL_CNT_NR (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR + TCPWM0_GRP_NR2_GRP_GRP_CNT_NR + TCPWM0_GRP_NR3_GRP_GRP_CNT_NR)
    #elif (TCPWM0_GRP_NR > 2)
        #define _CYHAL_TCPWM0_TOTAL_CNT_NR (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR + TCPWM0_GRP_NR2_GRP_GRP_CNT_NR)
    #elif (TCPWM0_GRP_NR > 1)
        #define _CYHAL_TCPWM0_TOTAL_CNT_NR (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR)
    #elif (TCPWM0_GRP_NR > 0)
        #define _CYHAL_TCPWM0_TOTAL_CNT_NR (TCPWM0_GRP_NR0_GRP_GRP_CNT_NR)
    #endif
    #if (TCPWM1_GRP_NR > 3)
        #define _CYHAL_TCPWM1_TOTAL_CNT_NR (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR + TCPWM1_GRP_NR2_GRP_GRP_CNT_NR + TCPWM1_GRP_NR3_GRP_GRP_CNT_NR)
    #elif (TCPWM1_GRP_NR > 2)
        #define _CYHAL_TCPWM1_TOTAL_CNT_NR (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR + TCPWM1_GRP_NR2_GRP_GRP_CNT_NR)
    #elif (TCPWM1_GRP_NR > 1)
        #define _CYHAL_TCPWM1_TOTAL_CNT_NR (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR)
    #elif (TCPWM1_GRP_NR > 0)
        #define _CYHAL_TCPWM1_TOTAL_CNT_NR (TCPWM1_GRP_NR0_GRP_GRP_CNT_NR)
    #endif
#endif

