RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_hwmgr_impl_part.h
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_HFROOT + 16, // Fast
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_HFROOT + 17, // Peri
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_HFROOT + 18, // Slow
};

#elif defined(COMPONENT_CAT1B)

#define CY_MXSPERI_PCLK_DIV_CNT(gr) ( \
        (PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT) + \
        (PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_VECT) + \
        (PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_5_VECT) + \
        (PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_24_5_VECT))

#define CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(gr) \
        (PERI_DIV_OFFSET##gr), \
        (PERI_DIV_OFFSET##gr + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT), \
        (PERI_DIV_OFFSET##gr + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_VECT), \
        (PERI_DIV_OFFSET##gr + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_VECT + PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_5_VECT)

#if (PERI_PERI_PCLK_PCLK_GROUP_NR > 0)
    #define PERI_DIV_OFFSET0  (0)
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR > 1)
    #define PERI_DIV_OFFSET1  (CY_MXSPERI_PCLK_DIV_CNT(0))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 2
    #define PERI_DIV_OFFSET2  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 3
    #define PERI_DIV_OFFSET3  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 4
    #define PERI_DIV_OFFSET4  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 5
    #define PERI_DIV_OFFSET5  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 6
    #define PERI_DIV_OFFSET6  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 7
    #define PERI_DIV_OFFSET7  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 8
    #define PERI_DIV_OFFSET8  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 9
    #define PERI_DIV_OFFSET9  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 10
    #define PERI_DIV_OFFSET10  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 11
    #define PERI_DIV_OFFSET11  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9) + CY_MXSPERI_PCLK_DIV_CNT(10))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 12
    #define PERI_DIV_OFFSET12  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9) + CY_MXSPERI_PCLK_DIV_CNT(10) + CY_MXSPERI_PCLK_DIV_CNT(11))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 13
    #define PERI_DIV_OFFSET13  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9) + CY_MXSPERI_PCLK_DIV_CNT(10) + CY_MXSPERI_PCLK_DIV_CNT(11) + CY_MXSPERI_PCLK_DIV_CNT(12))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 14
    #define PERI_DIV_OFFSET14  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9) + CY_MXSPERI_PCLK_DIV_CNT(10) + CY_MXSPERI_PCLK_DIV_CNT(11) + CY_MXSPERI_PCLK_DIV_CNT(12) + CY_MXSPERI_PCLK_DIV_CNT(13))
#endif
#if (PERI_PERI_PCLK_PCLK_GROUP_NR) > 15
    #define PERI_DIV_OFFSET15  (CY_MXSPERI_PCLK_DIV_CNT(0) + CY_MXSPERI_PCLK_DIV_CNT(1) + CY_MXSPERI_PCLK_DIV_CNT(2) + CY_MXSPERI_PCLK_DIV_CNT(3) + CY_MXSPERI_PCLK_DIV_CNT(4) + CY_MXSPERI_PCLK_DIV_CNT(5) + CY_MXSPERI_PCLK_DIV_CNT(6) + CY_MXSPERI_PCLK_DIV_CNT(7) + CY_MXSPERI_PCLK_DIV_CNT(8) + CY_MXSPERI_PCLK_DIV_CNT(9) + CY_MXSPERI_PCLK_DIV_CNT(10) + CY_MXSPERI_PCLK_DIV_CNT(11) + CY_MXSPERI_PCLK_DIV_CNT(12) + CY_MXSPERI_PCLK_DIV_CNT(13) + CY_MXSPERI_PCLK_DIV_CNT(14))
#endif


#if ((PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL + SRSS_NUM_HFROOT + 18) >= 256)
#error "Too many clocks to use uint8_t as offset type"
#endif

/* The order of items here must match the order in cyhal_clock_impl.h
 *
 * Each entry in the array below is the prior entry plus the number of clocks that exist
 * of the prior type. When there is only 1 clock (e.g: IMO/ECO) the next number is simply
 * one higher than the previous value. When there are multiple clocks (e.g.: PathMux/PLL)
 * the subsequent value is increased by the define that specifies how many clocks are
 * actually present. */
static const _cyhal_hwmgr_offset_t cyhal_block_offsets_clock[PERI_PERI_PCLK_PCLK_GROUP_NR * 4 + 22] =
{
    // Peripheral dividers (8-bit, 16-bit, 16.5-bit & 24.5 bit) for each group
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 0)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(0),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 1)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(1),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 2)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(2),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 3)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(3),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 4)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(4),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 5)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(5),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 6)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(6),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 7)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(7),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 8)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(8),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 9)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(9),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 10)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(10),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 11)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(11),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 12)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(12),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 13)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(13),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 14)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(14),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 15)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(15),
    #endif

