RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_hwmgr_impl_part.h
/* The order of items here must match the order in cyhal_clock_impl.h
 *
 * Each entry in the array below is the prior entry plus the number of clocks that exist
 * of the prior type. When there is only 1 clock (e.g: IMO/ECO) the next number is simply
 * one higher than the previous value. When there are multiple clocks (e.g.: PathMux/PLL)
 * the subsequent value is increased by the define that specifies how many clocks are
 * actually present. */
static const _cyhal_hwmgr_offset_t cyhal_block_offsets_clock[22] =
{
    // Peripheral dividers (8-bit, 16-bit, 16.5-bit & 24.5 bit) for each group
    // TODO: To be added

    PERI_DIV_NR,
    PERI_DIV_NR + 1,
    PERI_DIV_NR + 2,
    PERI_DIV_NR + 3,
    PERI_DIV_NR + 4,
    PERI_DIV_NR + 5,
    PERI_DIV_NR + 6,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + 6,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + 7,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + 8,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + 9,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 9,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 10,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 11,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 12,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 13,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 14,
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_HFROOT + 15,
};

#elif defined(COMPONENT_CAT2)
/* The order of items here must match the order in cyhal_clock_impl.h
 *
 * Each entry in the array below is the prior entry plus the number of clocks that exist
 * of the prior type. When there is only 1 clock (e.g: IMO/ECO) the next number is simply
 * one higher than the previous value. When there are multiple clocks (e.g.: PCLK)
 * the subsequent value is increased by the define that specifies how many clocks are
 * actually present. */
static const _cyhal_hwmgr_offset_t cyhal_block_offsets_clock[16] =
{
    0,                                                                  // 8-bit dividers
    PERI_PCLK_DIV_8_NR,                                                 // 16-bit dividers
    PERI_PCLK_DIV_8_NR + PERI_PCLK_DIV_16_NR,                           // 16.5 bit dividers
    PERI_PCLK_DIV_8_NR + PERI_PCLK_DIV_16_NR + PERI_PCLK_DIV_16_5_NR,   // 24.5 bit dividers

    PERI_PCLK_CLOCK_NR,                                                 // IMO
    PERI_PCLK_CLOCK_NR + 1,                                             // ECO
    PERI_PCLK_CLOCK_NR + 2,                                             // EXT
    PERI_PCLK_CLOCK_NR + 3,                                             // ILO
    PERI_PCLK_CLOCK_NR + 4,                                             // WCO

    PERI_PCLK_CLOCK_NR + 5,                                             // WDCSEL
    PERI_PCLK_CLOCK_NR + 6,                                             // PLLSEL
    PERI_PCLK_CLOCK_NR + 7,                                             // PLL
    PERI_PCLK_CLOCK_NR + 8,                                             // LF
    PERI_PCLK_CLOCK_NR + 9,                                             // HF
    PERI_PCLK_CLOCK_NR + 10,                                            // PUMP
    PERI_PCLK_CLOCK_NR + 11,                                            // SYS
};
#endif

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_dma[] =
{
    0,
#if defined(CY_IP_MXAHBDMAC_INSTANCES)
#if (CY_IP_MXAHBDMAC_INSTANCES > 1)
    MXAHBDMAC0_CH_NR,
#endif
#if (CY_IP_MXAHBDMAC_INSTANCES > 2)
    MXAHBDMAC0_CH_NR + MXAHBDMAC1_CH_NR,
#endif
#if (CY_IP_MXAHBDMAC_INSTANCES > 3)
    #warning "Unhandled DMA instance count"
#endif
#endif /* defined(CY_IP_MXAHBDMAC_INSTANCES) */
};

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
static const _cyhal_hwmgr_offset_t cyhal_block_offsets_dw[] =
{
    0,
    CPUSS_DW0_CH_NR,
};

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_tdm[] =
{
    0,
#if defined(CY_IP_MXTDM_INSTANCES)
#if (CY_IP_MXTDM_INSTANCES > 1)
    TDM_NR,
#endif
#endif
};
#endif

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_gpio[] =
{
    0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120,
    #if defined(COMPONENT_CAT1C)
    /* Most devices don't have more than 16 ports, so save the flash in most cases */
    128, 136, 144, 152, 160, 168, 176, 184, 192, 200, 208, 216, 224,
    232, 240, 248, 256, 264, 272, 280
    #endif
};

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_can[] =
{
#ifdef CY_IP_MXTTCANFD_INSTANCES
    #if (CY_IP_MXTTCANFD_INSTANCES > 0)
        0,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 1)
        CANFD0_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 2)
        CANFD0_CAN_NR + CANFD1_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 3)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 4)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 5)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR + CANFD4_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 6)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR + CANFD4_CAN_NR + CANFD5_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 7)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR + CANFD4_CAN_NR + CANFD5_CAN_NR + CANFD6_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 8)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR + CANFD4_CAN_NR + CANFD5_CAN_NR + CANFD6_CAN_NR + CANFD7_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 9)
        CANFD0_CAN_NR + CANFD1_CAN_NR + CANFD2_CAN_NR + CANFD3_CAN_NR + CANFD4_CAN_NR + CANFD5_CAN_NR + CANFD6_CAN_NR + CANFD7_CAN_NR + CANFD8_CAN_NR,
    #endif
    #if (CY_IP_MXTTCANFD_INSTANCES > 10)
        #warning "Unhandled CAN instance count"
    #endif
#else
    0
#endif
};

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_lpcomp[] =
{
    0,
#if (CY_BLOCK_COUNT_LPCOMP > 1)
    #error "Unhandled LPComp count"
#endif
};

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_opamp[] =
{
    0,
#if (CY_BLOCK_COUNT_OPAMP > 1)
    2,
#elif (CY_BLOCK_COUNT_OPAMP > 2)
    #error "Unhandled Opamp count"
#endif
};

static const _cyhal_hwmgr_offset_t cyhal_block_offsets_tcpwm[] =
{
    0,
#ifdef CY_IP_MXTCPWM_INSTANCES
    #if CY_IP_MXTCPWM_VERSION == 1
        #if (CY_IP_MXTCPWM_INSTANCES > 1)
            TCPWM0_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 2)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 3)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 4)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 5)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 6)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 7)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 8)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR + TCPWM7_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 9)
            TCPWM0_CNT_NR + TCPWM1_CNT_NR + TCPWM2_CNT_NR + TCPWM3_CNT_NR + TCPWM4_CNT_NR + TCPWM5_CNT_NR + TCPWM6_CNT_NR + TCPWM7_CNT_NR + TCPWM8_CNT_NR,
        #endif
        #if (CY_IP_MXTCPWM_INSTANCES > 10)
            #warning "Unhandled TCPWM instance count"
        #endif
    #else // CY_IP_MXTCPWM_VERSION >= 2
        #if (CY_IP_MXTCPWM_INSTANCES == 1)
            #if (TCPWM_GRP_NR > 1)
                TCPWM_GRP_NR0_GRP_GRP_CNT_NR,
            #endif
            #if (TCPWM_GRP_NR > 2)
                TCPWM_GRP_NR0_GRP_GRP_CNT_NR + TCPWM_GRP_NR1_GRP_GRP_CNT_NR,
            #endif
            #if (TCPWM_GRP_NR > 3)
                TCPWM_GRP_NR0_GRP_GRP_CNT_NR + TCPWM_GRP_NR1_GRP_GRP_CNT_NR + TCPWM_GRP_NR2_GRP_GRP_CNT_NR,
            #endif
        #elif (CY_IP_MXTCPWM_INSTANCES == 2)
            // The 'else's are placeholders to ensure the groups line up, even if groups are empty or absent
            #if (TCPWM0_GRP_NR > 1)
                TCPWM0_GRP_NR0_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR,
            #endif
            #if (TCPWM0_GRP_NR > 2)
                TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR,
            #endif
            #if (TCPWM0_GRP_NR > 3)
                TCPWM0_GRP_NR0_GRP_GRP_CNT_NR + TCPWM0_GRP_NR1_GRP_GRP_CNT_NR + TCPWM0_GRP_NR2_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR,
            #endif

            #if (TCPWM1_GRP_NR > 0)
                _CYHAL_TCPWM0_TOTAL_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR + _CYHAL_TCPWM1_TOTAL_CNT_NR,
            #endif
            #if (TCPWM1_GRP_NR > 1)
                _CYHAL_TCPWM0_TOTAL_CNT_NR + TCPWM1_GRP_NR0_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR +_CYHAL_TCPWM1_TOTAL_CNT_NR,
            #endif
            #if (TCPWM1_GRP_NR > 2)
                _CYHAL_TCPWM0_TOTAL_CNT_NR + TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR +_CYHAL_TCPWM1_TOTAL_CNT_NR,
            #endif
            #if (TCPWM1_GRP_NR > 3)
                _CYHAL_TCPWM0_TOTAL_CNT_NR + TCPWM1_GRP_NR0_GRP_GRP_CNT_NR + TCPWM1_GRP_NR1_GRP_GRP_CNT_NR + TCPWM1_GRP_NR2_GRP_GRP_CNT_NR,
            #else
                _CYHAL_TCPWM0_TOTAL_CNT_NR +_CYHAL_TCPWM1_TOTAL_CNT_NR,
            #endif
        #else
            #warning "Unhandled TCPWM instance count"
        #endif
    #endif
#endif
};

static uint8_t cyhal_used[(CY_TOTAL_ALLOCATABLE_ITEMS + 7) / 8] = {0};

